opera = {
    "плюс" : '+',
    "минус" : '-', 
    "умножение" : '*',
    "скобка_on" : '(',
    "скобка_off" : ')'
    }

def run():
    # Расставьте знаки операций "плюс", "минус", "умножение" и скобки
    # между числами "1 2 3 4 5" так, чтобы получилось число "25".
    #
    # Использовать нужно только указанные знаки операций, но не обязательно все перечисленные.
    # Порядок чисел нужно сохранить.

    numberations = [
         # Пример для чисел "1 2 3" и "9"
        ([1, 2, 3], ['(', '+', ') *']),
        # Расставляем знаки операций и скобки между числами 1 2 3 4 5, чтобы получить 25
        ([1, 2, 3, 4, 5], ['( (', '*', '+', ') *', ') +'])
    ]
    #result = ( 1 + 2 ) * 3
    #result = ( ( 1 * 2 + 3 ) * 4 ) + 5

    for no in numberations:
        print(next(compute(no[0], no[1])))

def compute(numbers, placement):
    expression = []
    for (numb, signs) in zip(numbers, placement):
        expression.append(f'{signs} {numb} ')
    e = ''.join(expression)
    yield f"{e} = {eval(e)}"

if __name__ == "__main__":
    run()